garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA1PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA1PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x510">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:desc="" edc:mask="0xf" edc:name="OPA1PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nnn" edc:cname="OPA1CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-000" edc:name="OPA1CON" edc:nzwidth="8" edc:por="0--0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x511">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1ORM" edc:desc="" edc:mask="0x3" edc:name="OPA1ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA1ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA1ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:desc="" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA1ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA1ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA1ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA1ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x512">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA2NCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA2NCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x513">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2NCH" edc:desc="" edc:mask="0xf" edc:name="OPA2NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA2PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA2PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x514">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA2PCH" edc:desc="" edc:mask="0xf" edc:name="OPA2PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nnn" edc:cname="OPA2CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-000" edc:name="OPA2CON" edc:nzwidth="8" edc:por="0--0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x515">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2ORM" edc:desc="" edc:mask="0x3" edc:name="OPA2ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA2ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA2ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2UG" edc:desc="" edc:mask="0x1" edc:name="OPA2UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2EN" edc:desc="" edc:mask="0x1" edc:name="OPA2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA2ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA2ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA2ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA2ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x516">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA3NCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA3NCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x517">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA3NCH" edc:desc="" edc:mask="0xf" edc:name="OPA3NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA3PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA3PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x518">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA3PCH" edc:desc="" edc:mask="0xf" edc:name="OPA3PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-n-nnn" edc:cname="OPA3CON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-000" edc:name="OPA3CON" edc:nzwidth="8" edc:por="00-0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x519">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA3ORM" edc:desc="" edc:mask="0x3" edc:name="OPA3ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA3ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA3ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA3UG" edc:desc="" edc:mask="0x1" edc:name="OPA3UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA3SP" edc:desc="" edc:mask="0x1" edc:name="OPA3SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA3EN" edc:desc="" edc:mask="0x1" edc:name="OPA3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA3ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA3ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA3ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA3ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA3ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA3ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x51A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA4NCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA4NCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x51B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA4NCH" edc:desc="" edc:mask="0xf" edc:name="OPA4NCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="OPA4PCHS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="OPA4PCHS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x51C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OPA4PCH" edc:desc="" edc:mask="0xf" edc:name="OPA4PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-n-nnn" edc:cname="OPA4CON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-000" edc:name="OPA4CON" edc:nzwidth="8" edc:por="00-0-000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x51D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORM" edc:desc="" edc:mask="0x3" edc:name="ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:desc="" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UG" edc:desc="" edc:mask="0x1" edc:name="UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORM0" edc:desc="" edc:mask="0x1" edc:name="ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ORM1" edc:desc="" edc:mask="0x1" edc:name="ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA4ORM" edc:desc="" edc:mask="0x3" edc:name="OPA4ORM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OPA4ORPOL" edc:desc="" edc:mask="0x1" edc:name="OPA4ORPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA4UG" edc:desc="" edc:mask="0x1" edc:name="OPA4UG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA4SP" edc:desc="" edc:mask="0x1" edc:name="OPA4SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA4EN" edc:desc="" edc:mask="0x1" edc:name="OPA4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA4ORM0" edc:desc="" edc:mask="0x1" edc:name="OPA4ORM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA4ORM1" edc:desc="" edc:mask="0x1" edc:name="OPA4ORM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA4ORS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA4ORS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02418_amp_opamp_hvpump_v2_F176x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x51E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:desc="" edc:mask="0xff" edc:name="ORS" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x58C"/>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="DACLD" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u0--00" edc:name="DACLD" edc:nzwidth="8" edc:por="--x0--00" edc:_addr="0x58D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1LD" edc:desc="" edc:mask="0x1" edc:name="DAC1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2LD" edc:desc="" edc:mask="0x1" edc:name="DAC2LD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="DAC5LD" edc:mask="0x1" edc:name="DAC5LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC6LD" edc:mask="0x1" edc:name="DAC6LD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
