garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC5REFH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC5REFH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x59A">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC5CON2"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC5REF8" edc:desc="" edc:mask="0x1" edc:name="DAC5REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF9" edc:desc="" edc:mask="0x1" edc:name="DAC5REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF10" edc:desc="" edc:mask="0x1" edc:name="DAC5REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF11" edc:desc="" edc:mask="0x1" edc:name="DAC5REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF12" edc:desc="" edc:mask="0x1" edc:name="DAC5REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF13" edc:desc="" edc:mask="0x1" edc:name="DAC5REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF14" edc:desc="" edc:mask="0x1" edc:name="DAC5REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF15" edc:desc="" edc:mask="0x1" edc:name="DAC5REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R8" edc:desc="" edc:mask="0x1" edc:name="R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R9" edc:desc="" edc:mask="0x1" edc:name="R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R10" edc:desc="" edc:mask="0x1" edc:name="R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R11" edc:desc="" edc:mask="0x1" edc:name="R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R12" edc:desc="" edc:mask="0x1" edc:name="R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R13" edc:desc="" edc:mask="0x1" edc:name="R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R14" edc:desc="" edc:mask="0x1" edc:name="R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R15" edc:desc="" edc:mask="0x1" edc:name="R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC5R8" edc:desc="" edc:mask="0x1" edc:name="DAC5R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R9" edc:desc="" edc:mask="0x1" edc:name="DAC5R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R10" edc:desc="" edc:mask="0x1" edc:name="DAC5R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R11" edc:desc="" edc:mask="0x1" edc:name="DAC5R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R12" edc:desc="" edc:mask="0x1" edc:name="DAC5R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R13" edc:desc="" edc:mask="0x1" edc:name="DAC5R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R14" edc:desc="" edc:mask="0x1" edc:name="DAC5R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R15" edc:desc="" edc:mask="0x1" edc:name="DAC5R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF8" edc:desc="" edc:mask="0x1" edc:name="REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF9" edc:desc="" edc:mask="0x1" edc:name="REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF10" edc:desc="" edc:mask="0x1" edc:name="REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF11" edc:desc="" edc:mask="0x1" edc:name="REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF12" edc:desc="" edc:mask="0x1" edc:name="REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF13" edc:desc="" edc:mask="0x1" edc:name="REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF14" edc:desc="" edc:mask="0x1" edc:name="REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF15" edc:desc="" edc:mask="0x1" edc:name="REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC6CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC6CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x59B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:desc="" edc:mask="0x1" edc:name="FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACFM" edc:desc="" edc:mask="0x1" edc:name="DACFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC6NSS" edc:desc="" edc:mask="0x3" edc:name="DAC6NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC6PSS" edc:desc="" edc:mask="0x3" edc:name="DAC6PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC6OE2" edc:desc="" edc:mask="0x1" edc:name="DAC6OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6OE1" edc:desc="" edc:mask="0x1" edc:name="DAC6OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6FM" edc:desc="" edc:mask="0x1" edc:name="DAC6FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6EN" edc:desc="" edc:mask="0x1" edc:name="DAC6EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC6NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC6NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC6NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC6PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC6PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC6PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
