garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:JoinedSFRDef edc:cname="DAC6REF" edc:desc="" edc:name="DAC6REF" edc:nzwidth="0x10" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x59C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC6REFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC6REFL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x59C">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC6CON1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC6REF0" edc:desc="" edc:mask="0x1" edc:name="DAC6REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF1" edc:desc="" edc:mask="0x1" edc:name="DAC6REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF2" edc:desc="" edc:mask="0x1" edc:name="DAC6REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF3" edc:desc="" edc:mask="0x1" edc:name="DAC6REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF4" edc:desc="" edc:mask="0x1" edc:name="DAC6REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF5" edc:desc="" edc:mask="0x1" edc:name="DAC6REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF6" edc:desc="" edc:mask="0x1" edc:name="DAC6REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF7" edc:desc="" edc:mask="0x1" edc:name="DAC6REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R5" edc:desc="" edc:mask="0x1" edc:name="R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R6" edc:desc="" edc:mask="0x1" edc:name="R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R7" edc:desc="" edc:mask="0x1" edc:name="R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC6R0" edc:desc="" edc:mask="0x1" edc:name="DAC6R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R1" edc:desc="" edc:mask="0x1" edc:name="DAC6R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R2" edc:desc="" edc:mask="0x1" edc:name="DAC6R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R3" edc:desc="" edc:mask="0x1" edc:name="DAC6R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R4" edc:desc="" edc:mask="0x1" edc:name="DAC6R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R5" edc:desc="" edc:mask="0x1" edc:name="DAC6R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R6" edc:desc="" edc:mask="0x1" edc:name="DAC6R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R7" edc:desc="" edc:mask="0x1" edc:name="DAC6R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF6" edc:desc="" edc:mask="0x1" edc:name="REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF7" edc:desc="" edc:mask="0x1" edc:name="REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC6REFH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC6REFH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x59D">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC6CON2"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC6REF8" edc:desc="" edc:mask="0x1" edc:name="DAC6REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF9" edc:desc="" edc:mask="0x1" edc:name="DAC6REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF10" edc:desc="" edc:mask="0x1" edc:name="DAC6REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF11" edc:desc="" edc:mask="0x1" edc:name="DAC6REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF12" edc:desc="" edc:mask="0x1" edc:name="DAC6REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF13" edc:desc="" edc:mask="0x1" edc:name="DAC6REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF14" edc:desc="" edc:mask="0x1" edc:name="DAC6REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6REF15" edc:desc="" edc:mask="0x1" edc:name="DAC6REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R8" edc:desc="" edc:mask="0x1" edc:name="R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R9" edc:desc="" edc:mask="0x1" edc:name="R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R10" edc:desc="" edc:mask="0x1" edc:name="R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R11" edc:desc="" edc:mask="0x1" edc:name="R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R12" edc:desc="" edc:mask="0x1" edc:name="R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R13" edc:desc="" edc:mask="0x1" edc:name="R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R14" edc:desc="" edc:mask="0x1" edc:name="R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R15" edc:desc="" edc:mask="0x1" edc:name="R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC6R8" edc:desc="" edc:mask="0x1" edc:name="DAC6R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R9" edc:desc="" edc:mask="0x1" edc:name="DAC6R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R10" edc:desc="" edc:mask="0x1" edc:name="DAC6R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R11" edc:desc="" edc:mask="0x1" edc:name="DAC6R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R12" edc:desc="" edc:mask="0x1" edc:name="DAC6R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R13" edc:desc="" edc:mask="0x1" edc:name="DAC6R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R14" edc:desc="" edc:mask="0x1" edc:name="DAC6R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC6R15" edc:desc="" edc:mask="0x1" edc:name="DAC6R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF8" edc:desc="" edc:mask="0x1" edc:name="REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF9" edc:desc="" edc:mask="0x1" edc:name="REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF10" edc:desc="" edc:mask="0x1" edc:name="REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF11" edc:desc="" edc:mask="0x1" edc:name="REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF12" edc:desc="" edc:mask="0x1" edc:name="REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF13" edc:desc="" edc:mask="0x1" edc:name="REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF14" edc:desc="" edc:mask="0x1" edc:name="REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF15" edc:desc="" edc:mask="0x1" edc:name="REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="DAC7CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="DAC7CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x59E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC7NSS" edc:desc="" edc:mask="0x3" edc:name="DAC7NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC7PSS" edc:desc="" edc:mask="0x3" edc:name="DAC7PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC7OE2" edc:desc="" edc:mask="0x1" edc:name="DAC7OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7OE1" edc:desc="" edc:mask="0x1" edc:name="DAC7OE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC7EN" edc:desc="" edc:mask="0x1" edc:name="DAC7EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="DAC7NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC7NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC7NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC7PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC7PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC7PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
