garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF4" edc:desc="" edc:mask="0x1" edc:name="G1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF5" edc:desc="" edc:mask="0x1" edc:name="G1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0x3f" edc:name="G1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG1CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG1CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1MD" edc:desc="" edc:mask="0x7" edc:name="G1MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x3" edc:name="G1CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1LD" edc:desc="" edc:mask="0x1" edc:name="G1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="G1MD0" edc:desc="" edc:mask="0x1" edc:name="G1MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD1" edc:desc="" edc:mask="0x1" edc:name="G1MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD2" edc:desc="" edc:mask="0x1" edc:name="G1MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS1" edc:desc="" edc:mask="0x1" edc:name="G1CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG1CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG1CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FDBS" edc:desc="" edc:mask="0x1" edc:name="FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDBS" edc:desc="" edc:mask="0x1" edc:name="RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POLA" edc:desc="" edc:mask="0x1" edc:name="G1POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLB" edc:desc="" edc:mask="0x1" edc:name="G1POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLC" edc:desc="" edc:mask="0x1" edc:name="G1POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLD" edc:desc="" edc:mask="0x1" edc:name="G1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1FDBS" edc:desc="" edc:mask="0x1" edc:name="G1FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RDBS" edc:desc="" edc:mask="0x1" edc:name="G1RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS0" edc:desc="" edc:mask="0x1" edc:name="G1RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS1" edc:desc="" edc:mask="0x1" edc:name="G1RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS2" edc:desc="" edc:mask="0x1" edc:name="G1RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS3" edc:desc="" edc:mask="0x1" edc:name="G1RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS4" edc:desc="" edc:mask="0x1" edc:name="G1RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS5" edc:desc="" edc:mask="0x1" edc:name="G1RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS6" edc:desc="" edc:mask="0x1" edc:name="G1RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS7" edc:desc="" edc:mask="0x1" edc:name="G1RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS8" edc:desc="" edc:mask="0x1" edc:name="RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS10" edc:desc="" edc:mask="0x1" edc:name="RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS8" edc:desc="" edc:mask="0x1" edc:name="G1RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS9" edc:desc="" edc:mask="0x1" edc:name="G1RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS10" edc:desc="" edc:mask="0x1" edc:name="G1RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS11" edc:desc="" edc:mask="0x1" edc:name="G1RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS12" edc:desc="" edc:mask="0x1" edc:name="G1RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS13" edc:desc="" edc:mask="0x1" edc:name="G1RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS14" edc:desc="" edc:mask="0x1" edc:name="G1RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS15" edc:desc="" edc:mask="0x1" edc:name="G1RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x697">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM0" edc:desc="" edc:mask="0x1" edc:name="RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM1" edc:desc="" edc:mask="0x1" edc:name="RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM2" edc:desc="" edc:mask="0x1" edc:name="RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM3" edc:desc="" edc:mask="0x1" edc:name="RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM4" edc:desc="" edc:mask="0x1" edc:name="RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM5" edc:desc="" edc:mask="0x1" edc:name="RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM6" edc:desc="" edc:mask="0x1" edc:name="RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM7" edc:desc="" edc:mask="0x1" edc:name="RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM0" edc:desc="" edc:mask="0x1" edc:name="G1RSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM1" edc:desc="" edc:mask="0x1" edc:name="G1RSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM2" edc:desc="" edc:mask="0x1" edc:name="G1RSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM3" edc:desc="" edc:mask="0x1" edc:name="G1RSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM4" edc:desc="" edc:mask="0x1" edc:name="G1RSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM5" edc:desc="" edc:mask="0x1" edc:name="G1RSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM6" edc:desc="" edc:mask="0x1" edc:name="G1RSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM7" edc:desc="" edc:mask="0x1" edc:name="G1RSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RSIM1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RSIM1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x698">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSIM8" edc:desc="" edc:mask="0x1" edc:name="RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM9" edc:desc="" edc:mask="0x1" edc:name="RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM10" edc:desc="" edc:mask="0x1" edc:name="RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM11" edc:desc="" edc:mask="0x1" edc:name="RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM12" edc:desc="" edc:mask="0x1" edc:name="RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM13" edc:desc="" edc:mask="0x1" edc:name="RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM14" edc:desc="" edc:mask="0x1" edc:name="RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSIM15" edc:desc="" edc:mask="0x1" edc:name="RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RSIM8" edc:desc="" edc:mask="0x1" edc:name="G1RSIM8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM9" edc:desc="" edc:mask="0x1" edc:name="G1RSIM9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM10" edc:desc="" edc:mask="0x1" edc:name="G1RSIM10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM11" edc:desc="" edc:mask="0x1" edc:name="G1RSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM12" edc:desc="" edc:mask="0x1" edc:name="G1RSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM13" edc:desc="" edc:mask="0x1" edc:name="G1RSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM14" edc:desc="" edc:mask="0x1" edc:name="G1RSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RSIM15" edc:desc="" edc:mask="0x1" edc:name="G1RSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
