garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG2CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG2CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x799">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG2ISET" edc:desc="" edc:mask="0x1f" edc:name="RG2ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG2ISET0" edc:desc="" edc:mask="0x1" edc:name="RG2ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET1" edc:desc="" edc:mask="0x1" edc:name="RG2ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET2" edc:desc="" edc:mask="0x1" edc:name="RG2ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET3" edc:desc="" edc:mask="0x1" edc:name="RG2ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET4" edc:desc="" edc:mask="0x1" edc:name="RG2ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3RTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3RTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSS" edc:desc="" edc:mask="0xf" edc:name="RTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RTSS0" edc:desc="" edc:mask="0x1" edc:name="RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS1" edc:desc="" edc:mask="0x1" edc:name="RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS2" edc:desc="" edc:mask="0x1" edc:name="RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTSS3" edc:desc="" edc:mask="0x1" edc:name="RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3RTSS0" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS1" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS2" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RTSS3" edc:desc="" edc:mask="0x1" edc:name="RG3RTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3FTSS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3FTSS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FTSS" edc:desc="" edc:mask="0xf" edc:name="FTSS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="FTSS0" edc:desc="" edc:mask="0x1" edc:name="FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS1" edc:desc="" edc:mask="0x1" edc:name="FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS2" edc:desc="" edc:mask="0x1" edc:name="FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FTSS3" edc:desc="" edc:mask="0x1" edc:name="FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3FTSS0" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS1" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS2" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FTSS3" edc:desc="" edc:mask="0x1" edc:name="RG3FTSS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG3INS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG3INS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INS" edc:desc="" edc:mask="0xf" edc:name="INS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="INS0" edc:desc="" edc:mask="0x1" edc:name="INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS1" edc:desc="" edc:mask="0x1" edc:name="INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS2" edc:desc="" edc:mask="0x1" edc:name="INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS3" edc:desc="" edc:mask="0x1" edc:name="INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3INS0" edc:desc="" edc:mask="0x1" edc:name="RG3INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS1" edc:desc="" edc:mask="0x1" edc:name="RG3INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS2" edc:desc="" edc:mask="0x1" edc:name="RG3INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3INS3" edc:desc="" edc:mask="0x1" edc:name="RG3INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PRG3CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PRG3CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OS" edc:desc="" edc:mask="0x1" edc:name="OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REDG" edc:desc="" edc:mask="0x1" edc:name="REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FEDG" edc:desc="" edc:mask="0x1" edc:name="FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3GO" edc:desc="" edc:mask="0x1" edc:name="RG3GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3OS" edc:desc="" edc:mask="0x1" edc:name="RG3OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE" edc:desc="" edc:mask="0x3" edc:name="RG3MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RG3REDG" edc:desc="" edc:mask="0x1" edc:name="RG3REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FEDG" edc:desc="" edc:mask="0x1" edc:name="RG3FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG3EN" edc:desc="" edc:mask="0x1" edc:name="RG3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE0" edc:desc="" edc:mask="0x1" edc:name="RG3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3MODE1" edc:desc="" edc:mask="0x1" edc:name="RG3MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----rnn" edc:cname="PRG3CON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PRG3CON1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPOL" edc:desc="" edc:mask="0x1" edc:name="RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FPOL" edc:desc="" edc:mask="0x1" edc:name="FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3RPOL" edc:desc="" edc:mask="0x1" edc:name="RG3RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3FPOL" edc:desc="" edc:mask="0x1" edc:name="RG3FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3RDY" edc:desc="" edc:mask="0x1" edc:name="RG3RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG3CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG3CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x79F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG3ISET" edc:desc="" edc:mask="0x1f" edc:name="RG3ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG3ISET0" edc:desc="" edc:mask="0x1" edc:name="RG3ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET1" edc:desc="" edc:mask="0x1" edc:name="RG3ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET2" edc:desc="" edc:mask="0x1" edc:name="RG3ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET3" edc:desc="" edc:mask="0x1" edc:name="RG3ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG3ISET4" edc:desc="" edc:mask="0x1" edc:name="RG3ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x80C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3PHR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x3f" edc:name="PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHR0" edc:desc="" edc:mask="0x1" edc:name="PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR1" edc:desc="" edc:mask="0x1" edc:name="PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR2" edc:desc="" edc:mask="0x1" edc:name="PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR3" edc:desc="" edc:mask="0x1" edc:name="PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR4" edc:desc="" edc:mask="0x1" edc:name="PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR5" edc:desc="" edc:mask="0x1" edc:name="PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3PHR0" edc:desc="" edc:mask="0x1" edc:name="G3PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR1" edc:desc="" edc:mask="0x1" edc:name="G3PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR2" edc:desc="" edc:mask="0x1" edc:name="G3PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR3" edc:desc="" edc:mask="0x1" edc:name="G3PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR4" edc:desc="" edc:mask="0x1" edc:name="G3PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHR5" edc:desc="" edc:mask="0x1" edc:name="G3PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3PHF0" edc:desc="" edc:mask="0x1" edc:name="G3PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF1" edc:desc="" edc:mask="0x1" edc:name="G3PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF2" edc:desc="" edc:mask="0x1" edc:name="G3PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF3" edc:desc="" edc:mask="0x1" edc:name="G3PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF4" edc:desc="" edc:mask="0x1" edc:name="G3PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3PHF5" edc:desc="" edc:mask="0x1" edc:name="G3PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x80F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3BLKR0" edc:desc="" edc:mask="0x1" edc:name="G3BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR1" edc:desc="" edc:mask="0x1" edc:name="G3BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR2" edc:desc="" edc:mask="0x1" edc:name="G3BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR3" edc:desc="" edc:mask="0x1" edc:name="G3BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR4" edc:desc="" edc:mask="0x1" edc:name="G3BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKR5" edc:desc="" edc:mask="0x1" edc:name="G3BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG3BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG3BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x810">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3BLKF0" edc:desc="" edc:mask="0x1" edc:name="G3BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF1" edc:desc="" edc:mask="0x1" edc:name="G3BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF2" edc:desc="" edc:mask="0x1" edc:name="G3BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF3" edc:desc="" edc:mask="0x1" edc:name="G3BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF4" edc:desc="" edc:mask="0x1" edc:name="G3BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3BLKF5" edc:desc="" edc:mask="0x1" edc:name="G3BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
