garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM4PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM4PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x90F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C4PCH" edc:desc="" edc:mask="0xf" edc:name="C4PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C4PCH0" edc:desc="" edc:mask="0x1" edc:name="C4PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH1" edc:desc="" edc:mask="0x1" edc:name="C4PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH2" edc:desc="" edc:mask="0x1" edc:name="C4PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4PCH3" edc:desc="" edc:mask="0x1" edc:name="C4PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM5CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM5CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x910">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C5SYNC" edc:desc="" edc:mask="0x1" edc:name="C5SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5HYS" edc:desc="" edc:mask="0x1" edc:name="C5HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C5ZLF" edc:desc="" edc:mask="0x1" edc:name="C5ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5POL" edc:desc="" edc:mask="0x1" edc:name="C5POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C5OUT" edc:desc="" edc:mask="0x1" edc:name="C5OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5ON" edc:desc="" edc:mask="0x1" edc:name="C5ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM5CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM5CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x911">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C5INTN" edc:desc="" edc:mask="0x1" edc:name="C5INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5INTP" edc:desc="" edc:mask="0x1" edc:name="C5INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM5NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM5NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x912">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C5NCH" edc:desc="" edc:mask="0xf" edc:name="C5NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C5NCH0" edc:desc="" edc:mask="0x1" edc:name="C5NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5NCH1" edc:desc="" edc:mask="0x1" edc:name="C5NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5NCH2" edc:desc="" edc:mask="0x1" edc:name="C5NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5NCH3" edc:mask="0x1" edc:name="C5NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM5PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM5PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x913">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C5PCH" edc:desc="" edc:mask="0xf" edc:name="C5PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C5PCH0" edc:desc="" edc:mask="0x1" edc:name="C5PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5PCH1" edc:desc="" edc:mask="0x1" edc:name="C5PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5PCH2" edc:desc="" edc:mask="0x1" edc:name="C5PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C5PCH3" edc:desc="" edc:mask="0x1" edc:name="C5PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM6CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM6CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x914">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C6SYNC" edc:desc="" edc:mask="0x1" edc:name="C6SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6HYS" edc:desc="" edc:mask="0x1" edc:name="C6HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C6ZLF" edc:desc="" edc:mask="0x1" edc:name="C6ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6POL" edc:desc="" edc:mask="0x1" edc:name="C6POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C6OUT" edc:desc="" edc:mask="0x1" edc:name="C6OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6ON" edc:desc="" edc:mask="0x1" edc:name="C6ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM6CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM6CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x915">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C6INTN" edc:desc="" edc:mask="0x1" edc:name="C6INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6INTP" edc:desc="" edc:mask="0x1" edc:name="C6INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM6NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM6NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x916">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C6NCH" edc:desc="" edc:mask="0xf" edc:name="C6NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C6NCH0" edc:desc="" edc:mask="0x1" edc:name="C6NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6NCH1" edc:desc="" edc:mask="0x1" edc:name="C6NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6NCH2" edc:desc="" edc:mask="0x1" edc:name="C6NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6NCH3" edc:mask="0x1" edc:name="C6NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
