garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM6PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM6PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x917">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C6PCH" edc:desc="" edc:mask="0xf" edc:name="C6PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C6PCH0" edc:desc="" edc:mask="0x1" edc:name="C6PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6PCH1" edc:desc="" edc:mask="0x1" edc:name="C6PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6PCH2" edc:desc="" edc:mask="0x1" edc:name="C6PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C6PCH3" edc:desc="" edc:mask="0x1" edc:name="C6PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM7CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM7CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x918">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C7SYNC" edc:desc="" edc:mask="0x1" edc:name="C7SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7HYS" edc:desc="" edc:mask="0x1" edc:name="C7HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C7ZLF" edc:desc="" edc:mask="0x1" edc:name="C7ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7POL" edc:desc="" edc:mask="0x1" edc:name="C7POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C7OUT" edc:desc="" edc:mask="0x1" edc:name="C7OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7ON" edc:desc="" edc:mask="0x1" edc:name="C7ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM7CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM7CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x919">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C7INTN" edc:desc="" edc:mask="0x1" edc:name="C7INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7INTP" edc:desc="" edc:mask="0x1" edc:name="C7INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM7NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM7NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C7NCH" edc:desc="" edc:mask="0xf" edc:name="C7NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C7NCH0" edc:desc="" edc:mask="0x1" edc:name="C7NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7NCH1" edc:desc="" edc:mask="0x1" edc:name="C7NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7NCH2" edc:desc="" edc:mask="0x1" edc:name="C7NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7NCH3" edc:mask="0x1" edc:name="C7NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM7PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM7PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C7PCH" edc:desc="" edc:mask="0xf" edc:name="C7PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C7PCH0" edc:desc="" edc:mask="0x1" edc:name="C7PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7PCH1" edc:desc="" edc:mask="0x1" edc:name="C7PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7PCH2" edc:desc="" edc:mask="0x1" edc:name="C7PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C7PCH3" edc:desc="" edc:mask="0x1" edc:name="C7PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-nn-nn" edc:cname="CM8CON0" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00-00" edc:name="CM8CON0" edc:nzwidth="8" edc:por="00-00-00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ZLF" edc:desc="" edc:mask="0x1" edc:name="ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C8SYNC" edc:desc="" edc:mask="0x1" edc:name="C8SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8HYS" edc:desc="" edc:mask="0x1" edc:name="C8HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C8ZLF" edc:desc="" edc:mask="0x1" edc:name="C8ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8POL" edc:desc="" edc:mask="0x1" edc:name="C8POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C8OUT" edc:desc="" edc:mask="0x1" edc:name="C8OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8ON" edc:desc="" edc:mask="0x1" edc:name="C8ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM8CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM8CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C8INTN" edc:desc="" edc:mask="0x1" edc:name="C8INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8INTP" edc:desc="" edc:mask="0x1" edc:name="C8INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM8NSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM8NSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="" edc:mask="0xf" edc:name="NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C8NCH" edc:desc="" edc:mask="0xf" edc:name="C8NCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C8NCH0" edc:desc="" edc:mask="0x1" edc:name="C8NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8NCH1" edc:desc="" edc:mask="0x1" edc:name="C8NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8NCH2" edc:desc="" edc:mask="0x1" edc:name="C8NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8NCH3" edc:mask="0x1" edc:name="C8NCH3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CM8PSEL" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CM8PSEL" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-01295_cmp_rr_v6_F177x.Module.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x91F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xf" edc:name="PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH3" edc:desc="" edc:mask="0x1" edc:name="PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C8PCH" edc:desc="" edc:mask="0xf" edc:name="C8PCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C8PCH0" edc:desc="" edc:mask="0x1" edc:name="C8PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8PCH1" edc:desc="" edc:mask="0x1" edc:name="C8PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8PCH2" edc:desc="" edc:mask="0x1" edc:name="C8PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C8PCH3" edc:desc="" edc:mask="0x1" edc:name="C8PCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
        <edc:AdjustPoint edc:offset="0x0f" edc:_addr="0xD0C"/>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="MD4CON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MD4CON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xD1B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD4BIT" edc:desc="" edc:mask="0x1" edc:name="MD4BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD4OPOL" edc:desc="" edc:mask="0x1" edc:name="MD4OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4OUT" edc:desc="" edc:mask="0x1" edc:name="MD4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD4EN" edc:desc="" edc:mask="0x1" edc:name="MD4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="MD4CON1" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="MD4CON1" edc:nzwidth="8" edc:por="--00--00" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xD1C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLSYNC" edc:desc="" edc:mask="0x1" edc:name="CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHSYNC" edc:desc="" edc:mask="0x1" edc:name="CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHPOL" edc:desc="" edc:mask="0x1" edc:name="CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD4CLSYNC" edc:desc="" edc:mask="0x1" edc:name="MD4CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CLPOL" edc:desc="" edc:mask="0x1" edc:name="MD4CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MD4CHSYNC" edc:desc="" edc:mask="0x1" edc:name="MD4CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CHPOL" edc:desc="" edc:mask="0x1" edc:name="MD4CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD4SRC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="MD4SRC" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xD1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MS" edc:desc="" edc:mask="0x1f" edc:name="MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MS0" edc:desc="" edc:mask="0x1" edc:name="MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS1" edc:desc="" edc:mask="0x1" edc:name="MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS2" edc:desc="" edc:mask="0x1" edc:name="MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS3" edc:desc="" edc:mask="0x1" edc:name="MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS4" edc:desc="" edc:mask="0x1" edc:name="MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD4MS" edc:desc="" edc:mask="0x1f" edc:name="MD4MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD4MS0" edc:desc="" edc:mask="0x1" edc:name="MD4MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4MS1" edc:desc="" edc:mask="0x1" edc:name="MD4MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4MS2" edc:desc="" edc:mask="0x1" edc:name="MD4MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4MS3" edc:desc="" edc:mask="0x1" edc:name="MD4MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4MS4" edc:desc="" edc:mask="0x1" edc:name="MD4MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
