garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD4CARL" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD4CARL" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xD1E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CL" edc:desc="" edc:mask="0x1f" edc:name="CL" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CL0" edc:desc="" edc:mask="0x1" edc:name="CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL1" edc:desc="" edc:mask="0x1" edc:name="CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL2" edc:desc="" edc:mask="0x1" edc:name="CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL3" edc:desc="" edc:mask="0x1" edc:name="CL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL4" edc:desc="" edc:mask="0x1" edc:name="CL4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD4CL" edc:desc="" edc:mask="0x1f" edc:name="MD4CL" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD4CL0" edc:desc="" edc:mask="0x1" edc:name="MD4CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CL1" edc:desc="" edc:mask="0x1" edc:name="MD4CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CL2" edc:desc="" edc:mask="0x1" edc:name="MD4CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CL3" edc:desc="" edc:mask="0x1" edc:name="MD4CL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CL4" edc:mask="0x1" edc:name="MD4CL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD4CARH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD4CARH" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xD1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0x1f" edc:name="CH" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH4" edc:desc="" edc:mask="0x1" edc:name="CH4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD4CH" edc:desc="" edc:mask="0x1f" edc:name="MD4CH" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD4CH0" edc:desc="" edc:mask="0x1" edc:name="MD4CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CH1" edc:desc="" edc:mask="0x1" edc:name="MD4CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CH2" edc:desc="" edc:mask="0x1" edc:name="MD4CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CH3" edc:desc="" edc:mask="0x1" edc:name="MD4CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD4CH4" edc:mask="0x1" edc:name="MD4CH4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdf0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xD8C"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWMEN" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWMEN" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM5EN" edc:mask="0x1" edc:name="MPWM5EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM6EN" edc:mask="0x1" edc:name="MPWM6EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM11EN" edc:mask="0x1" edc:name="MPWM11EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM12EN" edc:mask="0x1" edc:name="MPWM12EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWMLD" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWMLD" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD8F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM5LD" edc:mask="0x1" edc:name="MPWM5LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM6LD" edc:mask="0x1" edc:name="MPWM6LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM11LD" edc:mask="0x1" edc:name="MPWM11LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM12LD" edc:mask="0x1" edc:name="MPWM12LD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
