garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:JoinedSFRDef edc:cname="PWM6PR" edc:desc="" edc:name="PWM6PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM6PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6PRL" edc:desc="" edc:mask="0xff" edc:name="PWM6PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM6PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6PRH" edc:desc="" edc:mask="0xff" edc:name="PWM6PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM6OF" edc:desc="" edc:name="PWM6OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM6OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6OFL" edc:desc="" edc:mask="0xff" edc:name="PWM6OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM6OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM6OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM6OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM6OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM6OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM6OFH" edc:desc="" edc:mask="0xff" edc:name="PWM6OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
