garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1779.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD3MODPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD3MODPPS" edc:nzwidth="8" edc:por="--001101" edc:_addr="0xE29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD3MODPPS" edc:desc="" edc:mask="0x3f" edc:name="MD3MODPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD4CLPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD4CLPPS" edc:nzwidth="8" edc:por="--001100" edc:_addr="0xE2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD4CLPPS" edc:desc="" edc:mask="0x3f" edc:name="MD4CLPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD4CHPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD4CHPPS" edc:nzwidth="8" edc:por="--001011" edc:_addr="0xE2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD4CHPPS" edc:desc="" edc:mask="0x3f" edc:name="MD4CHPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD4MODPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="MD4MODPPS" edc:nzwidth="8" edc:por="--001010" edc:_addr="0xE2C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD4MODPPS" edc:desc="" edc:mask="0x3f" edc:name="MD4MODPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG1RPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG1RPPS" edc:nzwidth="8" edc:por="--000100" edc:_addr="0xE2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG1RPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG1RPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG1FPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG1FPPS" edc:nzwidth="8" edc:por="--000101" edc:_addr="0xE2E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG1FPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG1FPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG2RPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG2RPPS" edc:nzwidth="8" edc:por="--010001" edc:_addr="0xE2F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG2RPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG2RPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG2FPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG2FPPS" edc:nzwidth="8" edc:por="--010010" edc:_addr="0xE30">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG2FPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG2FPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG3RPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG3RPPS" edc:nzwidth="8" edc:por="--010100" edc:_addr="0xE31">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG3RPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG3RPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG3FPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG3FPPS" edc:nzwidth="8" edc:por="--010101" edc:_addr="0xE32">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG3FPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG3FPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG4RPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG4RPPS" edc:nzwidth="8" edc:por="--010100" edc:_addr="0xE33">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG4RPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG4RPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PRG4FPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PRG4FPPS" edc:nzwidth="8" edc:por="--010101" edc:_addr="0xE34">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRG4FPPS" edc:desc="" edc:mask="0x3f" edc:name="PRG4FPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="--000000" edc:_addr="0xE35">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:desc="" edc:mask="0x3f" edc:name="CLCIN0PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="--000001" edc:_addr="0xE36">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:desc="" edc:mask="0x3f" edc:name="CLCIN1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="--001110" edc:_addr="0xE37">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:desc="" edc:mask="0x3f" edc:name="CLCIN2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="--001111" edc:_addr="0xE38">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:desc="" edc:mask="0x3f" edc:name="CLCIN3PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCACTPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="ADCACTPPS" edc:nzwidth="8" edc:por="--001100" edc:_addr="0xE39">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCACTPPS" edc:mask="0x3f" edc:name="ADCACTPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
